<a href="https://colab.research.google.com/github/ejrtks1020/Bigdata_Analysis_Certification/blob/main/T1_18_%EC%8B%9C%EA%B3%84%EC%97%B4_%EB%8D%B0%EC%9D%B4%ED%84%B02_Expected_Question.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주어진 데이터에서 2022년 5월 주말과 평일의 sales컬럼 평균값 차이를 구하시오 (소수점 둘째자리까지 출력, 반올림)

In [ ]:
import pandas as pd

df = pd.read_csv("basic2.csv")

In [ ]:
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [ ]:
df['Date'] = pd.to_datetime(df['Date'])

In [ ]:
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day
df['dayofweek'] = df['Date'].dt.dayofweek

In [ ]:
df.head()

        Date     Sales      PV      UV  ...  month  week  day  dayofweek
0 2022-01-01  22711525  397349  4421.0  ...      1    52    1          5
1 2022-01-02     36779    3969  2289.0  ...      1    52    2          6
2 2022-01-03  13943875  373890     NaN  ...      1     1    3          0
3 2022-01-04   8088593  142054  2157.0  ...      1     1    4          1
4 2022-01-05   2395374  190684     NaN  ...      1     1    5          2

[5 rows x 10 columns]

In [ ]:
df['weekend'] = df['dayofweek'].apply(lambda x : x >= 5, 1, 0)

In [ ]:
weekend_sales_mean = df[(df['year'] == 2022) & (df['month'] == 5) & (df['weekend'] == 1)][['Sales']].mean()

In [ ]:
non_weekend_sales_mean = df[(df['year'] == 2022) & (df['month'] == 5) & (df['weekend'] == 0)][['Sales']].mean()

In [ ]:
dif = weekend_sales_mean - non_weekend_sales_mean

In [ ]:
round(dif ,2)

Sales    3010339.1
dtype: float64